aere-362/labs/8/NACA4412_solved/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
application     simpleDAFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2000;
deltaT          1;
writeControl    timeStep;
writeInterval   2000;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression on;
timeFormat      general;
timePrecision   8;
runTimeModifiable true;
DebugSwitches
{
    SolverPerformance 0;
}
