aere-362/labs/8/NACA4412_solved/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;
RAS 
{ 
    RASModel             SpalartAllmaras;
    turbulence           on;
    printCoeffs          off;
    Prt                  1;
} 

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
