aere-362/labs/8/NACA4412_solved/0.orig/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    "(wing.*)"
    {
        type            zeroGradient;
    }
    symmetry1
    {
        type            symmetry;
    }
    symmetry2
    {
        type            symmetry;
    }
    inout
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
