aere-362/labs/8/NACA4412_solved/0.orig/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.00025;

boundaryField
{
    "wing.*"
    {
        type            compressible::alphatWallFunction;
        value           $internalField;
    }
    symmetry1
    {
        type            symmetry;
    }
    symmetry2
    {
        type            symmetry;
    }
    inout
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
