aere-362/labs/8/NACA4412_solved/0.orig/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 5926.59;

boundaryField
{
    "(wing|wingte)"
    {
        type            omegaWallFunction;
        value           $internalField;
        blended         true;
    }
    symmetry1
    {
        type            symmetry;
    }
    symmetry2
    {
        type            symmetry;
    }
    inout
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
}



// ************************************************************************* //
