aere-362/labs/8/NACA4412_solved/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
ddtSchemes 
{
    default                                             steadyState;
}
gradSchemes
{
    default                                             Gauss linear;
}
interpolationSchemes
{
    default                                             linear;
}
laplacianSchemes
{
    default                                             Gauss linear corrected;
}
snGradSchemes
{
    default                                             corrected;
}
wallDist
{
    method                                              meshWave;
}
divSchemes
{
    default                                             none;
    div(phi,U)                                          bounded Gauss linearUpwindV grad(U);
    div(phi,e)                                          bounded Gauss upwind;
    div(phi,h)                                          bounded Gauss upwind;
    div(phi,T)                                          bounded Gauss upwind;
    div(phi,nuTilda)                                    bounded Gauss upwind;
    div(phi,k)                                          bounded Gauss upwind;
    div(phi,omega)                                      bounded Gauss upwind;
    div(phi,epsilon)                                    bounded Gauss upwind;
    div(phi,K)                                          bounded Gauss upwind;
    div(phi,Ekp)                                        bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U)))))                       Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U)))))                 Gauss linear;
    div(pc)                                             bounded Gauss upwind;
}
