aere-362/labs/8/NACA4412_solved/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
SIMPLE
{
    nNonOrthogonalCorrectors           0;
}
solvers
{
    "(p|p_rgh|G)"
    {
        
        solver                         GAMG;
        smoother                       GaussSeidel;
        relTol                         0.1;
        tolerance                      0;
    }
    Phi
    {
        $p;
        relTol                         0;
        tolerance                      1e-6;
    }
    "(U|T|e|h|nuTilda|k|omega|epsilon)"
    {
        solver                         smoothSolver;
        smoother                       GaussSeidel;
        relTol                         0.1;
        tolerance                      0;
        nSweeps                        1;
    }
}
potentialFlow
{
    nNonOrthogonalCorrectors           20;
}  
relaxationFactors
{
    fields
    {
        "(p|p_rgh)"                         0.30;
        rho                                   0.10;
    }
    equations
    {
        "(U|T|e|h|nuTilda|k|epsilon|omega)" 0.70;
    }

}

